tap "cloudfoundry/tap"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "homebrew/services"

brew "git"
brew "the_silver_searcher"
brew "node"
brew "jq"
brew "httpie"
brew "watch"
brew "bash-git-prompt"
brew "awscli"
brew "azure-cli"
brew "bats-core"
brew "cf-cli"
brew "coreutils"
brew "multitail"
brew "ncdu"
brew "node"
brew "openjdk"
brew "pstree"
brew "pv"
brew "python"
brew "python@3.8"
brew "readline"
brew "ruby"
brew "speedtest-cli"
brew "sslscan"

# productivity apps
cask "flycut"      # keep paste buffers
cask "spectacle"   # window manager, free
cask "iterm2"      
cask "keepassxc"   # GSA-approved password manager
cask "visual-studio-code"
cask "alfred"
cask "intelliscape-caffeine"
cask "powershell"
cask "docker"
# cask "slack"
cask "vlc"
cask "grandperspective"
cask "deckset"

# work/life balance
cask "1password"
cask "send-to-kindle"
cask "spotify"
cask "toggl"
cask "time-out"
