tap "cloudfoundry/tap"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "homebrew/services"

#brew "azure-cli"
brew "anchore/grype/grype"
brew "aws-vault"
brew "awscli"
brew "bash-git-prompt"
brew "bats-core"
brew "c7n"
brew "cloudfoundry/tap/cf-cli"
brew "cloudfoundry/tap/cf-cli@8"
brew "cloudfoundry/tap/uaa-cli"
brew "curl"
brew "ffmpeg"
brew "gh"
brew "git"
brew "gnu-sed"
brew "gnupg"
brew "go"
brew "httpie"
brew "hub"
brew "jq"
brew "mkdocs"
brew "multitail"
brew "ncdu"
brew "nmap"
brew "node"
brew "openjdk"
brew "pandoc"
brew "pstree"
brew "pv"
brew "python@3.8"
brew "ruby"
brew "scorecard"
brew "shellcheck"
brew "speedtest-cli"
brew "sslscan"
brew "starship"
brew "switchaudio-osx"
brew "the_silver_searcher"
brew "tree"
brew "watch"
brew "wget"
brew "yarn"
brew "ykman"
brew "yq"

# productivity apps
#cask "deckset"
#cask "docker"
#cask "powershell"
#cask "zoomus"
cask "alfred"
cask "caffeine"
cask "firefox"
cask "flycut"      # keep paste buffers
cask "iterm2"      
cask "keepassxc"   # GSA-approved password manager
cask "spectacle"   # window manager, free
cask "visual-studio-code"
cask "vlc"

# work/life balance
#cask "toggl"
cask "1password"
cask "basictex"
cask "bluesnooze"
cask "github"
cask "grandperspective"
cask "spotify"
cask "time-out"