tap "cloudfoundry/tap"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "homebrew/services"

# installed by laptop
brew "git"
brew "hub"
brew "libgit2"
brew "pyenv"
brew "pyenv-virtualenv"
brew "pyenv-virtualenvwrapper"
brew "the_silver_searcher"
brew "cloudfoundry/tap/cf-cli"
cask "github"

# my sanity apps

brew "bash-git-prompt"
cask "flycut"      # keep paste buffers
cask "spectacle"   # window manager, free
# case "sizeup"     # non-free windows manager, use Magnets instead if possible
cask "iterm2"      
cask "keepassxc"   # GSA-approved password manager
cask "visual-studio-code"
cask "alfred"      # Because, awesome. 
cask "1password"
cask "toggl"       # TogglDesktop for time tracking

# MBP apps
brew "azure-cli"

cask "powershell"
cask "docker"
cask "alfred"
